# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'nvm'
brew 'redis'
brew 'yarn'
brew 'deno'

# Apps
cask 'keeweb'
cask 'dbngin'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'phpmon'
cask 'jetbrains-toolbox'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
cask 'tunnelblick'
cask 'zoom'
cask 'microsoft-teams'
cask 'postman'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
